ltowarek/esp-opentelemetry-cpp/examples/metrics/ostream/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

CONFIG_FREERTOS_HZ=1000

CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

CONFIG_ESP_OPENTELEMETRY_METRICS_ENABLED=y
CONFIG_ESP_OPENTELEMETRY_SERVICE_NAME="metrics-ostream-example"

# The metrics export thread (protobuf serialisation + periodic reader) needs
# more stack than the 3 KB IDF default.
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=32768
